{"format": "graph-model", "generatedBy": "2.16.2", "convertedBy": "TensorFlow.js Converter v4.21.0", "signature": {"inputs": {"ip_address_in_link:0": {"name": "ip_address_in_link:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "tag_count_in_head_tag:0": {"name": "tag_count_in_head_tag:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "copied:0": {"name": "copied:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "no_title:0": {"name": "no_title:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "unknown:0": {"name": "unknown:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1351}, "iframe_tag_count:0": {"name": "iframe_tag_count:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "no_domain_in_internal_link:0": {"name": "no_domain_in_internal_link:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "script_tag_count:0": {"name": "script_tag_count:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "external_link_percentage:0": {"name": "external_link_percentage:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "invalid_kiyaku:0": {"name": "invalid_kiyaku:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "google_analytics:0": {"name": "google_analytics:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "same_page_link_count:0": {"name": "same_page_link_count:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "copied", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "external_link_percentage", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "google_analytics", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "iframe_tag_count", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "invalid_kiyaku", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "ip_address_in_link", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "no_domain_in_internal_link", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "no_title", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "same_page_link_count", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "script_tag_count", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "tag_count_in_head_tag", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14", "op": "NoOp", "input": ["^copied", "^external_link_percentage", "^tag_count_in_head_tag", "^unknown", "^google_analytics", "^iframe_tag_count", "^invalid_kiyaku", "^ip_address_in_link", "^no_domain_in_internal_link", "^no_title", "^same_page_link_count", "^script_tag_count"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast", "op": "Cast", "input": ["copied", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_1", "op": "Cast", "input": ["google_analytics", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_5", "op": "Cast", "input": ["iframe_tag_count", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_7", "op": "Cast", "input": ["invalid_kiyaku", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_8", "op": "Cast", "input": ["ip_address_in_link", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_3", "op": "Cast", "input": ["no_title", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_4", "op": "Cast", "input": ["same_page_link_count", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_2", "op": "Cast", "input": ["script_tag_count", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_6", "op": "Cast", "input": ["tag_count_in_head_tag", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/values", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/stack", "op": "Pack", "input": ["StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast", "external_link_percentage", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_1", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_5", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_7", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_8", "no_domain_in_internal_link", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_3", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_4", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_2", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_6"], "attr": {"N": {"i": "11"}, "axis": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/inference_op", "op": "SimpleMLInferenceOpWithHandle", "input": ["StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/stack", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/Const", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/Const_1", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/values", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/Const", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/Const_1", "unknown"], "attr": {"_has_manual_control_dependencies": {"b": true}, "dense_output_dim": {"i": "2"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/inference_op", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "modelInitializer": {"node": [{"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "1598", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "op": "SimpleMLCreateModelResource", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8"], "attr": {"_has_manual_control_dependencies": {"b": true}, "shared_name": {"s": "c2ltcGxlX21sX21vZGVsXzNlMzUzNTU3LTYyNTMtNDE4ZS05MGY4LTY5NjUyZmFiM2NkZV9sb2FkXzk5MQ=="}, "container": {"s": ""}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_2", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/output/_1", "op": "Identity", "input": ["StatefulPartitionedCall/Identity"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input_control_node/_3", "op": "NoOp", "input": ["^1598", "^Func/StatefulPartitionedCall/output/_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input/_5", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_5", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input/_4", "op": "Identity", "input": ["1598", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_4", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace", "op": "StaticRegexReplace", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": ""}, "pattern": {"s": "NDFkMWVkMzhkZTBlNGM5NWRvbmU="}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle", "op": "SimpleMLLoadModelFromPathWithHandle", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace"], "attr": {"_has_manual_control_dependencies": {"b": true}, "file_prefix": {"s": "NDFkMWVkMzhkZTBlNGM5NQ=="}, "output_types": {"list": {}}, "allow_slow_inference": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15", "op": "NoOp", "input": ["^StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/output_control_node/_7", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2", "^Func/StatefulPartitionedCall_1/output_control_node/_7"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}], "versions": {"producer": 1766}}, "initializerSignature": {"outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1351}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/Const", "shape": [0, 0], "dtype": "float32"}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/Const_1", "shape": [0, 0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/values", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "1598", "shape": [], "dtype": "string"}]}]}